rosflight/rosflight_firmware/boards/stm32_h7/varmint_11X/specific/Callbacks.cpp
/**
 ******************************************************************************
 * File     : Callbacks.cpp
 *
 * Date     : Sep 27, 2023
 ******************************************************************************
 *
 * Copyright (c) 2023, AeroVironment, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1.Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2.Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * 3.Neither the name of the copyright holder nor the names of its
 * contributors may be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 **/
#include "stm32h753xx.h"
#include <stm32_h7.hpp>
extern STM32H7Board stm32_h7_board;

#include <Time64.h>
extern Time64 time64;

#include <Callbacks.h>

#include <BoardConfig.h>

#include <Polling.h>

//////////////////////////////////////////////////////////////////////////////////////////
// High Rate (10kHz) Periodic Timer Interrupt Routine for Polling
//
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef * htim)
{
  if (htim->Instance == POLL_HTIM_INSTANCE) // Filter out other timer interrupts.
  {
    static uint64_t poll_counter = 0;
    poll_counter++;
    // Baro and Mag share SPI, offset mag by one count to avoid conflicts.
    stm32_h7_board.baro_.poll(poll_counter);
    stm32_h7_board.mag_.poll(poll_counter + 1); // Checks for data ready and start dma read

    stm32_h7_board.pitot_.poll(
      poll_counter); // Periodic start, check for data ready, and start dma read

    stm32_h7_board.rc_.poll();              // Restart if dead
    stm32_h7_board.gps_.poll();             // Restart if dead
    stm32_h7_board.telem_.poll();           // Check for new data packet to tx
    stm32_h7_board.adc_.poll(poll_counter); // Start dma read
    stm32_h7_board.vcp_.poll();             // Timeout

    if (0 == poll_counter % (POLLING_FREQ_HZ / 2)) GRN_TOG; // Blink Green LED at 1 Hz.
  }
}

//////////////////////////////////////////////////////////////////////////////////////////
// EXTI (Data Ready) Interrupts

void HAL_GPIO_EXTI_Callback(uint16_t exti_pin)
{
  if (stm32_h7_board.imu0_.isMy(exti_pin)) { stm32_h7_board.imu0_.startDma(); }
  if (stm32_h7_board.imu1_.isMy(exti_pin)) { stm32_h7_board.imu1_.startDma(); }
  if (stm32_h7_board.gps_.isMy(exti_pin)) { stm32_h7_board.gps_.pps(time64.Us()); }
}

//////////////////////////////////////////////////////////////////////////////////////////
// SPI Tx complete callback
//
// void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)  // All spi dma tx interrupts are handled here.
//{
//}

// SPI Rx complete callback
void HAL_SPI_TxRxCpltCallback(
  SPI_HandleTypeDef * hspi) // All spi dma rx interrupts are handled here.
{
  // do not use 'else if' since some of these share SPI
  if (stm32_h7_board.imu0_.isMy(hspi)) { stm32_h7_board.imu0_.endDma(); }
  if (stm32_h7_board.imu1_.isMy(hspi)) { stm32_h7_board.imu1_.endDma(); }
  if (stm32_h7_board.mag_.isMy(hspi)) { stm32_h7_board.mag_.endDma(); }
  if (stm32_h7_board.baro_.isMy(hspi)) { stm32_h7_board.baro_.endDma(); }
}
//////////////////////////////////////////////////////////////////////////////////////////
// I2C Rx complete callback

void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef * hi2c)
{
  if (stm32_h7_board.pitot_.isMy(hi2c)) stm32_h7_board.pitot_.endDma();
}

//////////////////////////////////////////////////////////////////////////////////////////
// UART Rx complete callbacks
//
void HAL_UART_RxCpltCallback(UART_HandleTypeDef * huart)
{
  if (stm32_h7_board.rc_.isMy(huart)) stm32_h7_board.rc_.endDma();
  if (stm32_h7_board.gps_.isMy(huart)) stm32_h7_board.gps_.endDma();
}

void UART_RxIsrCallback(UART_HandleTypeDef * huart)
{
  if (__HAL_UART_GET_FLAG(huart, UART_FLAG_IDLE)) // Serial Idle Management
  {
    __HAL_UART_CLEAR_IDLEFLAG(huart);
    if (huart->hdmarx != 0) ((DMA_Stream_TypeDef *) (huart->hdmarx)->Instance)->CR &= ~DMA_SxCR_EN;
  } else {
    if (stm32_h7_board.telem_.isMy(huart)) { stm32_h7_board.telem_.rxIsrCallback(huart); }
  }
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef * huart)
{
  if (stm32_h7_board.telem_.isMy(huart)) stm32_h7_board.telem_.txStart();
}

//////////////////////////////////////////////////////////////////////////////////////////
// ADC Rx complete callback

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef * hadc)
{
  if (stm32_h7_board.adc_.isMy(hadc)) stm32_h7_board.adc_.endDma(hadc);
}

//////////////////////////////////////////////////////////////////////////////////////////
// VCP

void CDC_Receive_Callback(uint8_t chan, uint8_t * buffer, uint16_t size)
{
  if (chan == 0) stm32_h7_board.vcp_.rxCdcCallback(buffer, size);
}

void CDC_TransmitCplt_Callback(uint8_t chan, uint8_t * buffer, uint16_t size)
{
  if (chan == 0) stm32_h7_board.vcp_.txCdcCallback();
}

//////////////////////////////////////////////////////////////////////////////////////////
// SD card
void HAL_SD_TxCpltCallback(SD_HandleTypeDef * hsd)
{
  if (stm32_h7_board.sd_.isMy(hsd)) { stm32_h7_board.sd_.endTxDma(hsd); }
}

void HAL_SD_RxCpltCallback(SD_HandleTypeDef * hsd)
{
  if (stm32_h7_board.sd_.isMy(hsd)) { stm32_h7_board.sd_.endRxDma(hsd); }
}
